Catalogs/Renault_МодулиДляВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_МодулиДляВыполнения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ВидыВыполненияМодулей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийИзменивший</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРегламентноеЗадание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗаданиеGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоВыражение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Запросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяЗапроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстЗапроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыТаблицы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Строка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеБД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пояснение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/Renault_ВидыВыполненияМодулей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_ВидыВыполненияМодулей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаКлиенте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСервере</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Renault_ПараметрыПодключенияКСервисам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_ПараметрыПодключенияКСервисам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Renault_МодулиДляВыполнения/Ext/ManagerModule.bsl
Процедура ВыполнитьМодуль(Ссылка, СтруктураПараметров = Неопределено) Экспорт
	
	Если СтруктураПараметров = Неопределено Тогда
		СтруктураПараметров = ПолучитьСтруктуруПараметров(Ссылка);
	КонецЕсли;
	
	Если СтруктураПараметров = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекстыЗапросов = Неопределено;
	
	Попытка 
		ТекстыЗапросов = ПолучитьСтруктуруТекстовЗапросов(Ссылка);
	Исключение
		Сообщить("Ошибка при заполнении структуры запросов:" + Символы.ПС + ОписаниеОшибки());		
	КонецПопытки;
	
	Если Ссылка.ВидВыполнения = Перечисления.Renault_ВидыВыполненияМодулей.НаСервере Тогда
		
		Renault_СерверныеФункцииМодуляДляВыполнения.ВыполнитьКодНаСервере(Ссылка.ТекстМодуля, СтруктураПараметров, ТекстыЗапросов);
		
	Иначе
		
		ВыполнитьКодНаКлиенте(Ссылка.ТекстМодуля, СтруктураПараметров, ТекстыЗапросов);
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьСтруктуруТекстовЗапросов(Ссылка, Отказ = Ложь) Экспорт
	
	СтруктураТекстовЗапросов = Новый Структура;
	
	Для Каждого СтрокаЗапрос Из Ссылка.Запросы Цикл
		
		СтруктураТекстовЗапросов.Вставить(СтрокаЗапрос.ИмяЗапроса, СтрокаЗапрос.ТекстЗапроса);
		
	КонецЦикла;
	
	Возврат СтруктураТекстовЗапросов;
	
КонецФункции

Функция ПолучитьСтруктуруПараметров(Ссылка, Отказ = Ложь) Экспорт
	
	СтруктураПараметров = Новый Структура;
	
	Для Каждого СтрокаПараметра Из Ссылка.Параметры Цикл
		
		Попытка 
			
			СтруктураПараметров.Вставить(СтрокаПараметра.ИмяПараметра, СтрокаПараметра.ЗначениеПараметра);
			
		Исключение
			
			Отказ = Истина;
			Сообщить("Ошибка при установке параметра № " + СтрокаПараметра.НомерСтроки + ": " + СтрокаПараметра.ИмяПараметра + "");
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции

Функция ПолучитьТаблицуПараметров(Ссылка, Отказ = Ложь) Экспорт
	
	ТаблицаПараметров = Новый ТаблицаЗначений;
	ТаблицаПараметров.Колонки.Добавить("ИмяПараметра");
	ТаблицаПараметров.Колонки.Добавить("ЭтоВыражение");
	ТаблицаПараметров.Колонки.Добавить("ЗначениеПараметра");
	
	Для Каждого СтрокаПараметраМодуля Из Ссылка.Параметры Цикл
		
		ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СтрокаПараметраМодуля);
		
	КонецЦикла;
	
	Возврат ТаблицаПараметров;
	
КонецФункции

Процедура ВыполнитьКодНаКлиенте(ТекстМодуля, СтруктураПараметров = Неопределено, СтруктураЗапросов = Неопределено) Экспорт
	
	Выполнить(ТекстМодуля);
	
КонецПроцедуры

Функция Из_10_В_Любую(Знач Значение=0,Нотация=36) Экспорт
     Если Нотация<=0 Тогда Возврат("") КонецЕсли;
     Значение=Число(Значение);
     Если Значение<=0 Тогда Возврат("0") КонецЕсли;
     Значение=Цел(Значение);
     Результат="";
     Пока Значение>0 Цикл
          Результат=Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ",Значение%Нотация+1,1)+Результат;
          Значение=Цел(Значение/Нотация) ;
     КонецЦикла;
     Возврат Результат;
КонецФункции

Процедура ЗаполнитьТаблицуПараметров (ИмяМакета, ПараметрыТаблицы) Экспорт

    Макет = Справочники.Renault_МодулиДляВыполнения.ПолучитьМакет(ИмяМакета);

    Для х = 2 По Макет.ВысотаТаблицы Цикл

        СтрокаТЗ = ПараметрыТаблицы.Добавить();

        СтрокаТЗ.Строка      = Макет.Область("R"+х+"C1").Текст;
        СтрокаТЗ.Пояснение   = Макет.Область("R"+х+"C2").Текст;
        СтрокаТЗ.ПолеБД      = Макет.Область("R"+х+"C3").Текст;
        СтрокаТЗ.Описание    = Макет.Область("R"+х+"C4").Текст;
        СтрокаТЗ.Тип         = ПолучитьТипПоСтроке(Макет.Область("R"+х+"C5").Текст);
        СтрокаТЗ.Длина       = Число(?(Макет.Область("R"+х+"C6").Текст = "",0,Макет.Область("R"+х+"C6").Текст));
        СтрокаТЗ.Начало      = Число(?(Макет.Область("R"+х+"C7").Текст = "",0,Макет.Область("R"+х+"C7").Текст));
        СтрокаТЗ.Обязательно = ?(Макет.Область("R"+х+"C8").Текст = "O",Истина, Ложь);
        СтрокаТЗ.Формат      = Макет.Область("R"+х+"C9").Текст;

    КонецЦикла;

КонецПроцедуры

Функция ПолучитьТипПоСтроке (Текст)
	Если Текст = "A" Тогда
		Возврат "Строка";
	ИначеЕсли Текст = "N" Тогда
		Возврат "Число";
	ИначеЕсли Текст = "P" Тогда
		Возврат "Константа";
	КонецЕсли;
	Возврат "";
КонецФункции

Функция СформироватьСтрокуПоШаблону (СтрокаРезультата, Шаблон, ИтогоСтрок = 0) Экспорт

    СтрокаДокумента = "";

    Для Каждого СтрокаШаблона из Шаблон Цикл

        Если Найти(СтрокаШаблона.Формат, "СЗ=") > 0 Тогда
            СимволЗаполнения = Сред(СтрокаШаблона.Формат,Найти(СтрокаШаблона.Формат, "СЗ=")+3,4);  
        Иначе
            СимволЗаполнения = Неопределено;
        КонецЕсли;

        Если СтрокаШаблона.Обязательно Тогда
            Если СтрокаШаблона.Тип = "Константа" Тогда
                СтрокаДокумента = СтрокаДокумента + СтрокаШаблона.ПолеБД;
            ИначеЕсли СтрокаШаблона.ПолеБД = "ИтогоСтрок" Тогда
                ШестнадцатеричноеЧисло = Справочники.Renault_МодулиДляВыполнения.Из_10_В_Любую(ИтогоСтрок, 16);
                СтрокаДокумента = СтрокаДокумента + ЗаполнитьСтроку(ШестнадцатеричноеЧисло,СтрокаШаблона.Длина, СимволЗаполнения);
            ИначеЕсли СтрокаШаблона.Тип = "Число" Тогда
                СтрокаДокумента = СтрокаДокумента +СтрЗаменить(Формат(СтрокаРезультата[СтрокаШаблона.ПолеБД], СтрокаШаблона.Формат),",","");
            Иначе
                СтрокаДокумента = СтрокаДокумента + ЗаполнитьСтроку(Формат(СтрокаРезультата[СтрокаШаблона.ПолеБД], СтрокаШаблона.Формат),СтрокаШаблона.Длина, СимволЗаполнения);
            КонецЕсли;
        Иначе
            СтрокаДокумента = СтрокаДокумента + ЗаполнитьСтроку(,СтрокаШаблона.Длина,СимволЗаполнения);
        КонецЕсли;

    КонецЦикла;

    Возврат СтрокаДокумента;

КонецФункции

Функция ЗаполнитьСтроку (ИсходнаяСтрока = "", Длина, СимволЗаполнения = Неопределено) Экспорт

    Если СимволЗаполнения = Неопределено Тогда
        СимволЗаполнения = " ";
    КонецЕсли;

    Недостающие = Длина - СтрДлина(ИсходнаяСтрока);

    Для х = 1 По Недостающие Цикл
        Если СимволЗаполнения = "0" Тогда 
            ИсходнаяСтрока = СимволЗаполнения + ИсходнаяСтрока;
        Иначе
            ИсходнаяСтрока = ИсходнаяСтрока + СимволЗаполнения;
        КонецЕсли;
    КонецЦикла;

    Возврат ИсходнаяСтрока;

КонецФункции

Процедура ОтправитьТекстовыйДокумертРекурсивно (ТекстовыйДокумент, сПараметров, КоличествоЗапусков = 0) Экспорт

    Попытка
        ОтправитьТекстовыйДокумент(ТекстовыйДокумент, сПараметров);
    Исключение
        Если КоличествоЗапусков < 10 Тогда
            КоличествоЗапусков = КоличествоЗапусков + 1;
            ОтправитьТекстовыйДокумертРекурсивно(ТекстовыйДокумент, сПараметров, КоличествоЗапусков);
        Иначе
            ВызватьИсключение;
        КонецЕсли;
    КонецПопытки;

КонецПроцедуры

Процедура ОтправитьТекстовыйДокумент (ТекстовыйДокумент, сПараметров) Экспорт

    Сервер = СтрокаСоединенияИнформационнойБазы();
    Прокси = ПолучитьВебСервис();

    ФайлыКОтправке = Новый ТаблицаЗначений;
    ФайлыКОтправке.Колонки.Добавить("Имя");
    ФайлыКОтправке.Колонки.Добавить("Данные");
    ФайлыКОтправке.Колонки.Добавить("ПолныйПуть");
    ИмяФайла = "" + сПараметров.БИР +".BIR."+сПараметров.Поток+"."+сПараметров.БИР+"."+сПараметров.НомерСообщения;

    ИмяТемпФайла = ПолучитьИмяВременногоФайла();
    сПолногоИмени = Renault_ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ИмяТемпФайла);

    ЗаписьТекста = Новый ЗаписьТекста(сПолногоИмени.Путь+ИмяФайла, "iso-8859-5",,Истина);
    для х=1 по ТекстовыйДокумент.КоличествоСтрок() Цикл
        ЗаписьТекста.ЗаписатьСтроку(ТекстовыйДокумент.ПолучитьСтроку(х));
    КонецЦикла;
    ЗаписьТекста.Закрыть();
    Нов = ФайлыКОтправке.Добавить();
    Нов.Имя        = ИмяФайла;
    Нов.ПолныйПуть = сПолногоИмени.Путь+ИмяФайла;
    Нов.Данные     = Новый ХранилищеЗначения(
                         Новый ДвоичныеДанные(сПолногоИмени.Путь+ИмяФайла),
                         Новый СжатиеДанных(9));

    Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
    ПакетXDTO = Сериализатор.ЗаписатьXDTO(ФайлыКОтправке);
    Ответ = Прокси.Put(ПакетXDTO, сПараметров.Бир, Сервер);

    Если Ответ Тогда
        Для Каждого СтрокаТЗ из ФайлыКОтправке Цикл
            Попытка
                УдалитьФайлы(сПолногоИмени.Путь+ИмяФайла);  
            Исключение
                ЗаписьЖурналаРегистрации("Задача обмена (Протокол TDFa)", УровеньЖурналаРегистрации.Ошибка,,
                , ОписаниеОшибки());
                ВызватьИсключение;
            КонецПопытки;
        КонецЦикла;
    КонецЕсли;

КонецПроцедуры

Функция ПолучитьВебСервис() 
	
	ДанныеПодключения = Справочники.Renault_ПараметрыПодключенияКСервисам.ПолучитьПараметрыПодключенияПоСсылке(
		Справочники.Renault_ПараметрыПодключенияКСервисам.WSGate,
		"TDFa.1cws");
	Адрес = ДанныеПодключения.Адрес;
	ЛогинWS = ДанныеПодключения.Логин;
	ПарольWS = ДанныеПодключения.Пароль;
	
	WSОпределение = Новый WSОпределения(
		СокрЛП(Адрес),
		СокрЛП(ЛогинWS),
		СокрЛП(ПарольWS));
	ВебСервис = Новый WSПрокси(
		WSОпределение, 
		"http://v8.1c.ru/8.1/data/core", 
		"Renault_TDFa", 
		"Renault_TDFaSoap12",
		3600);
	ВебСервис.Пользователь = СокрЛП(ЛогинWS);
	ВебСервис.Пароль = СокрЛП(ПарольWS);
	Возврат ВебСервис;
	
КонецФункции

// Изменение кодировки строки из unicode в указанное значение
Функция ЗакодироватьСтроку(знач Значение, Кодировка) Экспорт
	
	НРегКодировка	= НРег(Кодировка);
	Результат		= "";
	
	Если НРегКодировка = "utf-8" Тогда
		Результат = СтрокаВUTF_8(Значение);
	Иначе 
		Соответствие = ПолучитьМассивКодов(Кодировка);
		Если НЕ ТипЗнч(Соответствие) = Тип("Соответствие") Тогда
			Возврат Значение;
		КонецЕсли;
		
		Длина = СтрДлина(Значение);
		Для Индекс = 1 По Длина Цикл
			Символ = Сред(Значение, Индекс, 1);
			
			Код = Соответствие.Получить(Символ);
			Если Код = Неопределено Тогда
				Результат = Результат + Сред(Значение, Индекс, 1);
			Иначе 
				Результат = Результат + Символ(Код);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Перевод строки unicode в UTF-8
Функция СтрокаВUTF_8(знач Значение) Экспорт
	
	КолСимволов = СтрДлина(Значение);
	Результат	= "";
	
	Для Индекс = 1 По КолСимволов Цикл
		ЗначениеКода = КодСимвола(Значение, Индекс);
		
		Массив = Новый Массив;
		
		Если ЗначениеКода < 128 Тогда
			Массив.Добавить(ЗначениеКода);
		ИначеЕсли ЗначениеКода >= 128 И ЗначениеКода <= 2047 Тогда
			Массив.Добавить(192 + Цел(ЗначениеКода / 64));
			Массив.Добавить(128 + ЗначениеКода % 64);
		ИначеЕсли ЗначениеКода >= 2048 И ЗначениеКода <= 65535 Тогда
			Массив.Добавить(224 + Цел(ЗначениеКода / 64 / 64));
			Массив.Добавить(128 + Цел(ЗначениеКода / 64) % 64);
			Массив.Добавить(128 + ЗначениеКода % 64);
		ИначеЕсли ЗначениеКода >= 65536 И ЗначениеКода <= 2097151 Тогда
			Массив.Добавить(240 + Цел(ЗначениеКода / 64 / 64 / 64));
			Массив.Добавить(128 + Цел(ЗначениеКода / 64 / 64) % 64);
			Массив.Добавить(128 + Цел(ЗначениеКода / 64) % 64);
			Массив.Добавить(128 + ЗначениеКода % 64);
		ИначеЕсли ЗначениеКода >= 2097152 И ЗначениеКода <= 67108863 Тогда
			Массив.Добавить(248 + Цел(ЗначениеКода / 64 / 64 / 64 / 64));
			Массив.Добавить(128 + Цел(ЗначениеКода / 64 / 64 / 64) % 64);
			Массив.Добавить(128 + Цел(ЗначениеКода / 64 / 64) % 64);
			Массив.Добавить(128 + Цел(ЗначениеКода / 64) % 64);
			Массив.Добавить(128 + ЗначениеКода % 64);
		ИначеЕсли ЗначениеКода >= 67108864 И ЗначениеКода <= 2147483647 Тогда
			Массив.Добавить(252 + Цел(ЗначениеКода / 64 / 64 / 64 / 64 / 64));
			Массив.Добавить(128 + Цел(ЗначениеКода / 64 / 64 / 64 / 64) % 64);
			Массив.Добавить(128 + Цел(ЗначениеКода / 64 / 64 / 64) % 64);
			Массив.Добавить(128 + Цел(ЗначениеКода / 64 / 64) % 64);
			Массив.Добавить(128 + Цел(ЗначениеКода / 64) % 64);
			Массив.Добавить(128 + ЗначениеКода % 64);
		КонецЕсли;
		
		Для Каждого ЗначениеКода Из Массив Цикл
			Результат = Результат + Символ(ЗначениеКода);
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Перевод строки UTF-8 в unicode
Функция UTF_8ВСтроку(знач Значение) Экспорт
	
	КолСимволов = СтрДлина(Значение);
	Результат	= "";
	
	Для Индекс = 1 По КолСимволов Цикл
		а = КодСимвола(Значение, Индекс);
		б = КодСимвола(Значение, Индекс + 1);
		в = КодСимвола(Значение, Индекс + 2);
		г = КодСимвола(Значение, Индекс + 3);
		д = КодСимвола(Значение, Индекс + 4);
		е = КодСимвола(Значение, Индекс + 5);
		
		Если а >= 0 И а <= 127 Тогда
			ЗначениеКода = а;
		ИначеЕсли а >= 192 И а <= 223 Тогда
			Индекс			= Индекс + 1;
			ЗначениеКода	= (а - 192) * 64
							+ (б - 128);
		ИначеЕсли а >= 224 И а <= 239 Тогда
			Индекс			= Индекс + 2;
			ЗначениеКода	= (а - 224) * 64 * 64
							+ (б - 128) * 64
							+ (в - 128);
		ИначеЕсли а >= 240 И а <= 247 Тогда
			Индекс			= Индекс + 3;
			ЗначениеКода	= (а - 240) * 64 * 64 * 64
							+ (б - 128) * 64 * 64
							+ (в - 128) * 64
							+ (г - 128);
		ИначеЕсли а >= 248 И а <= 251 Тогда
			Индекс			= Индекс + 4;
			ЗначениеКода	= (а - 248) * 64 * 64 * 64 * 64
							+ (б - 128) * 64 * 64 * 64
							+ (в - 128) * 64 * 64
							+ (г - 128) * 64
							+ (д - 128);
		ИначеЕсли а >= 252 И а <= 253 Тогда
			Индекс			= Индекс + 5;
			ЗначениеКода	= (а - 252) * 64 * 64 * 64 * 64 * 64
							+ (б - 128) * 64 * 64 * 64 * 64
							+ (в - 128) * 64 * 64 * 64
							+ (г - 128) * 64 * 64
							+ (д - 128) * 64
							+ (е - 128);
		КонецЕсли;
		
		Результат = Результат + Символ(ЗначениеКода);
	КонецЦикла;
	
	Возврат ЗакодироватьСтроку(Результат, "iso-8859-5");
КонецФункции

Функция ПолучитьМассивПоИмениКодировки(ИмяКодировки)
	Массив	= Неопределено;
	НрегИмя	= НРег(ИмяКодировки);
	
	Если НрегИмя = "koi8-r" Тогда
		Массив = Получить_koi8_r();
	ИначеЕсли НрегИмя = "koi8-u" Тогда
		Массив = Получить_koi8_u();
	ИначеЕсли НрегИмя = "windows-1251" ИЛИ НрегИмя = "cp1251" Тогда
		Массив = Получить_windows_1251();
	ИначеЕсли НрегИмя = "cp866" Тогда
		Массив = Получить_cp_866();
	ИначеЕсли НрегИмя = "iso-8859-5" Тогда
		Массив = Получить_iso_8859_5();
	КонецЕсли;
	
	Возврат Массив;
КонецФункции

// Возвращает соответствие символов значениям кодам по различным кодировкам
//	Перечень кодировок см. в функции Кодировки
//
// Параметры
//	ИмяКодировки - Строка.
//
// Возвращаемое значение
//	Соответствие
//
Функция ПолучитьМассивКодов(Кодировка)
	
	Соответствие = Новый Соответствие;
	Массив = ПолучитьМассивПоИмениКодировки(Кодировка);
	Если Массив = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Счетчик	= 0;
	Для Каждого Символ Из Массив Цикл
		Счетчик = Счетчик + 1;
		Соответствие.Вставить(Символ, Счетчик);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

// Возвращает массив имен кодировок соответствие по которым можно получить
Функция Кодировки() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить("koi8-r");
	Массив.Добавить("koi8-u");
	Массив.Добавить("windows-1251");
	Массив.Добавить("cp1251");
	Массив.Добавить("cp866");
	Массив.Добавить("iso-8859-5");
	
	Возврат Массив;
	
КонецФункции

// Возвращает массив символов koi8-r
Функция Получить_koi8_r() 
	
	Koi8_r_2_ansi	= "-¦-¬L-++T++---¦¦---?¦•v??? ?°?·?=¦-ёгг¬¬¬LLL---¦¦¦¦Ё¦¦TTT¦¦¦+++©юабцдефгх"
					+ "ийклмнопярстужвьызшэщчъЮАБЦДЕФГХИЙКЛМНОПЯРСТУЖВЬЫЗШЭЩЧЪ";
	
	Массив		= НачальныйМассив();
	КолСимволов	= СтрДлина(Koi8_r_2_ansi);
	Для Индекс = 1 По КолСимволов Цикл
		Массив.Добавить(Сред(Koi8_r_2_ansi, Индекс, 1));
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

// Возвращает массив символов koi8-u
Функция Получить_koi8_u() 
	
	Koi8_u_2_ansi	= "-¦-¬L-++T++---¦¦---?¦•v??? ?°?·?=¦-ёєгії¬LLL-ґў¦¦¦¦ЁЄ¦ІЇT¦¦¦+ҐЎ©юабцдефгх"
					+ "ийклмнопярстужвьызшэщчъЮАБЦДЕФГХИЙКЛМНОПЯРСТУЖВЬЫЗШЭЩЧЪ";
	
	Массив		= НачальныйМассив();
	КолСимволов	= СтрДлина(Koi8_u_2_ansi);
	Для Индекс = 1 По КолСимволов Цикл
		Массив.Добавить(Сред(Koi8_u_2_ansi, Индекс, 1));
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

// Возвращает массив символов windows-1251
Функция Получить_windows_1251() 
	
	win1251_2_ansi	= "ЂЃ‚ѓ„…†‡€‰Љ‹ЊЌЋЏђ‘’“”•–—™љ›њќћџЎўЈ¤Ґ¦§Ё©Є«¬®Ї°±Ііґµ¶·ё№є»јЅѕїАБВГДЕЖЗИЙ"
					+ "КЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдежзийклмнопрстуфхцчшщъыьэюя";
	
	Массив		= НачальныйМассив();
	КолСимволов	= СтрДлина(win1251_2_ansi);
	Для Индекс = 1 По КолСимволов Цикл
		Массив.Добавить(Сред(win1251_2_ansi, Индекс, 1));
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

// Возвращает массив символов cp866 (oem dos)
Функция Получить_cp_866() 
	
	cp866_2_ansi	= "АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдежзийклмноп---¦+¦¦¬¬¦¦¬---¬L+T+-+¦¦L"
					+ "г¦T¦=+¦¦TTLL-г++----¦¦-рстуфхцчшщъыьэюяЁёЄєЇїЎў°•·v№¤¦ ";
	
	Массив		= НачальныйМассив();
	КолСимволов	= СтрДлина(cp866_2_ansi);
	Для Индекс = 1 По КолСимволов Цикл
		Массив.Добавить(Сред(cp866_2_ansi, Индекс, 1));
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

// Возвращает массив символов iso-8859-5 (cyr)
Функция Получить_iso_8859_5() 
	
	iso88595_2_ansi	= "??????????????????????????????? ЁЂЃЄЅІЇЈЉЊЋЌЎЏАБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШ"
					+ "ЩЪЫЬЭЮЯабвгдежзийклмнопрстуфхцчшщъыьэюя№ёђѓєѕіїјљњћќ§ўџ";
	
	Массив		= НачальныйМассив();
	КолСимволов	= СтрДлина(iso88595_2_ansi);
	Для Индекс = 1 По КолСимволов Цикл
		Массив.Добавить(Сред(iso88595_2_ansi, Индекс, 1));
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

Функция НачальныйМассив()
	
	Массив = Новый Массив;
	
	Для Индекс = 1 По 127 Цикл
		Если Индекс < 32 ИЛИ Индекс = 127 Тогда
			Массив.Добавить("#" + Строка(Индекс));
		Иначе 
			Массив.Добавить(Символ(Индекс));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции


// Возвращает строку номера без символьных префиксов
// Например:
//  ПолучитьСтроковыйНомерБезПрефиксов("УТ0000001234") = "0000001234"
//
// Параметры:
//  Номер – Строка – номер, из которого необходимо вычислить результат функции
// 
//  Возвращаемое значение:
//  строка номера без символьных префиксов
//
Функция ПолучитьСтроковыйНомерБезПрефиксов(Номер) Экспорт
	
	НомерБезПрефиксов = "";
	Сч = СтрДлина(Номер);
	
	Пока Сч > 0 Цикл
		
		Символ = Сред(Номер, Сч, 1);
		
		Если (Символ >= "0" И Символ <= "9") Тогда
			
			НомерБезПрефиксов = Символ + НомерБезПрефиксов;
			
		Иначе
			
			Возврат НомерБезПрефиксов;
			
		КонецЕсли;
		
		Сч = Сч - 1;
		
	КонецЦикла;
	
	Возврат НомерБезПрефиксов;
	
КонецФункции

// Разбирает строку, выделяя из нее префикс и числовую часть.
//
// Параметры:
//  Стр            - Строка. Разбираемая строка;
//  ЧисловаяЧасть  - Число. Переменная, в которую возвратится числовая часть строки;
//  Режим          - Строка. Если "Число", то возвратит числовую часть, иначе - префикс.
//
// Возвращаемое значение:
//  Префикс строки
//
Функция ПолучитьПрефиксЧислоНомера(Знач Стр, ЧисловаяЧасть = "", Режим = "") Экспорт

	ЧисловаяЧасть = 0;
	Префикс = "";
	Стр = СокрЛП(Стр);
	Длина   = СтрДлина(Стр);
	
	СтроковыйНомерБезПрефикса = ПолучитьСтроковыйНомерБезПрефиксов(Стр);
	ДлинаСтроковойЧасти = СтрДлина(СтроковыйНомерБезПрефикса);
	Если ДлинаСтроковойЧасти > 0 Тогда
		ЧисловаяЧасть = Число(СтроковыйНомерБезПрефикса);
		Префикс = Сред(Стр, 1, Длина - ДлинаСтроковойЧасти);
	Иначе
		Префикс = Стр;	
	КонецЕсли;

	Если Режим = "Число" Тогда
		Возврат(ЧисловаяЧасть);
	Иначе
		Возврат(Префикс);
	КонецЕсли;

КонецФункции

// Приводит номер (код) к требуемой длине. При этом выделяется префикс
// и числовая часть номера, остальное пространство между префиксом и
// номером заполняется нулями.
// Функция может быть использована в обработчиках событий, программный код 
// которых хранится в правила обмена данными. Вызывается методом Выполнить()
// Сообщение "Не обнаружено ссылок на функцию" при проверке конфигурации 
// не является ошибкой проверки конфигурации
//
// Параметры:
//  Стр          - преобразовываемая строка;
//  Длина        - требуемая длина строки.
//
// Возвращаемое значение:
//  Строка       - код или номер, приведенная к требуемой длине.
// 
Функция ПривестиНомерКДлине(Знач Стр, Длина, ДобавлятьНулиЕслиДлинаНеМеньшеТекущейДлиныНомера = Истина, Префикс = "") Экспорт

	Если ПустаяСтрока(Стр)
		ИЛИ СтрДлина(Стр) = Длина Тогда
		
		Возврат Стр;
		
	КонецЕсли;
	
	Стр             = СокрЛП(Стр);
	ВходящаяДлинаНомера = СтрДлина(Стр);

	ЧисловаяЧасть   = "";
	ПрефиксНомераСтроки   = ПолучитьПрефиксЧислоНомера(Стр, ЧисловаяЧасть);
	
	ИтоговыйПрефикс = ?(ПустаяСтрока(Префикс), ПрефиксНомераСтроки, Префикс);
	ДлинаИтоговогоПрефикса = СтрДлина(ИтоговыйПрефикс);
	
	СтрокаЧисловойЧасти = Формат(ЧисловаяЧасть, "ЧГ=0");
	ДлинаЧисловойЧасти = СтрДлина(СтрокаЧисловойЧасти);

	Если (Длина >= ВходящаяДлинаНомера И ДобавлятьНулиЕслиДлинаНеМеньшеТекущейДлиныНомера)
		ИЛИ (Длина < ВходящаяДлинаНомера) Тогда
		
		Для ВременнаяПеременная = 1 По Длина - ДлинаИтоговогоПрефикса - ДлинаЧисловойЧасти Цикл
			
			СтрокаЧисловойЧасти = "0" + СтрокаЧисловойЧасти;
			
		КонецЦикла;
	
	КонецЕсли;
	
	// обрезаем лишние символы
	СтрокаЧисловойЧасти = Прав(СтрокаЧисловойЧасти, Длина - ДлинаИтоговогоПрефикса);
		
	Результат = ИтоговыйПрефикс + СтрокаЧисловойЧасти;

	Возврат Результат;

КонецФункции // ПривестиНомерКДлине()
